const rule = {
    'А': 'A', 'а': "а",
    'Б': 'B', 'б': "b",
    'В': 'V', 'в': "v",
    'Г': 'H', 'г': "h",
    'Ґ': 'G', 'ґ': "g",
    'Д': 'D', 'д': "d",
    'Е': 'E', 'е': "е",
    'Є': "Ie", 'є': "ie",
    'Ж': 'Zh', 'ж': "zh",
    'З': "Z", 'з': "z",
    'И': "Y", 'и': "y",
    'І': "I", 'і': "i",
    'Ї': "I", 'ї': "i",
    'Й': "Y", 'й': "i",
    'К': "K", 'к': "k",
    'Л': "L", 'л': "l",
    'М': "M", 'м': "m",
    'Н': "N", 'н': "n",
    'О': "O", 'о': "o",
    'П': "P", 'п': "p",
    'Р': "R", 'р': "r",
    'С': "S", 'с': "s",
    'Т': "T", 'т': "t",
    'У': "U", 'у': "u",
    'Ф': "F", 'ф': "f",
    'Х': "Kh", 'х': "kh",
    'Ц': "Ts", 'ц': "ts",
    'Ч': "Ch", 'ч': "ch",
    'Ш': "Sh", 'ш': "sh",
    'Щ': "Shch", 'щ': "shch",
    'Ю': 'Iu', 'ю': "iu",
    'Я': 'Ia', 'я': "ia",
    'Зг': 'Zgh', 'зг': 'zgh',
    "\"": "", "`": "",
    "’": "", "'": "",
    "ь": "", "Ь": ""
}

const firstRule = {
    'Є': "Ye", 'є': "ye",
    'Ї': "Yi", 'ї': "yi",
    'Ю': "Y", 'ю': 'y',
    'Я': "Ya", 'я': 'ya',

}


function translit(text) {
    return text.split(" ").map((word) => {
        // перевірка на зг
        if (word.match('зг|Зг|ЗГ')){
            word = word.replace('зг','zgh').replace('Зг','Zgh').replace('ЗГ',"ZGH")
        }
        // перевірка на наявність я ю є ї на початку слова
        if (["Я", "Ю", "Є", "Ї", 'я', 'ю', 'є', 'ї'].includes(word[0])) {
            let head = firstRule[(word[0])]
            let tail = word.slice(1).split('').map((char) => {
                if (Object.keys(rule).includes(char)) {
                    return rule[char]
                } else {
                    return char
                }
            }).join('')
            return head + tail
        } else {
            return word.split('').map(
                (char) => {
                    if (Object.keys(rule).includes(char)) {
                        return rule[char]
                    } else {
                        return char
                    }
                }
            ).join('')
        }
    }).join(" ")
}


function f1(text) {
    res = ''
    letters =Object.keys(rule)
    firstRuleLetters= Object.keys(firstRule)
    // заміняємо всі зг
    text=text.replace('зг','zgh').replace('Зг','Zgh').replace('ЗГ',"ZGH")
    for (let i=0;i < text.length;i++){
        let char = text.charAt(i)
        // перевірка на наявність символа в правилах для перши літер я|ю|є|ї а також на те що це початок слова
        if (!letters.includes(text.charAt(i-1)) && firstRuleLetters.includes(char)){
            res=res.concat(firstRule[char])
        // перевірка на наявність символа в загальних правилах для літер
        }else if(letters.includes(char)){

            res=res.concat(rule[char])
        // інакше просто додаємо симол який знайшли
        }else {
            res=res.concat(char)
        }
    }
    return res
}
text =  "Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка.Ліна Костенко – одна з чільних постатей у плеяді українського шістдесятництва. Народилася вона на Київщині, у 1956 році закінчила Літературний інститут імені М. Горького в Москві. Але після виходу трьох перших збірок поетеса була заборонена на шістнадцять років. Повернення в літературу відбулося 1977 року, коли світ побачила збірка «Над берегами вічної ріки». \n" +
    "\n" +
    "Творчість поетеси має щонайширший спектр: тут і монументальні твори, і мінімалістичні форми, тут трагізм та іскрометна іронія, тут занурення в глибини історії та гостре і парадоксальне бачення сучасності. Принципово перебуваючи за межами будь-яких шкіл, Ліна Костенко зумовила радикальну, філософську, стилістичну та мовну трансформацію української літератури. Також вона переклала багатьох польських, а також чеських, єврейських, грузинських поетів. Твори Ліни Костенко також перекладені різними мовами, а саме: англійською, французькою, німецькою, іспанською, усіма мовами Сходу Європи тощо.\n" +
    "\n" +
    "Упродовж тривалого періоду поетеса вивчала зону біля Чорнобиля в складі історико-культурної експедиції. Результат цієї праці – сценарій фільму «Чорнобиль. Тризна».\n" +
    "\n" +
    "Ліна Костенко – почесний професор Національного університету «Києво-Могилянська академія». У 1987 році вона стала лауреатом Національної премії України імені Тараса Шевченка."
let start= new Date().getTime();
(async ()=> await f1(text))()
let end = new Date().getTime();
console.log(`1 cycle: ${end - start}ms`);
// console.log(translit(text))

 start= new Date().getTime();
(async ()=> await translit(text))()
 end = new Date().getTime();
console.log(`6 cycles: ${end - start}ms`);