const rule = {
    'А': 'A', 'а': "а",
    'Б': 'B', 'б': "b",
    'В': 'V', 'в': "v",
    'Г': 'H', 'г': "h",
    'Ґ': 'G', 'ґ': "g",
    'Д': 'D', 'д': "d",
    'Е': 'E', 'е': "е",
    'Є': "Ie", 'є': "ie",
    'Ж': 'Zh', 'ж': "zh",
    'З': "Z", 'з': "z",
    'И': "Y", 'и': "y",
    'І': "I", 'і': "i",
    'Ї': "I", 'ї': "i",
    'Й': "Y", 'й': "i",
    'К': "K", 'к': "k",
    'Л': "L", 'л': "l",
    'М': "M", 'м': "m",
    'Н': "N", 'н': "n",
    'О': "O", 'о': "o",
    'П': "P", 'п': "p",
    'Р': "R", 'р': "r",
    'С': "S", 'с': "s",
    'Т': "T", 'т': "t",
    'У': "U", 'у': "u",
    'Ф': "F", 'ф': "f",
    'Х': "Kh", 'х': "kh",
    'Ц': "Ts", 'ц': "ts",
    'Ч': "Ch", 'ч': "ch",
    'Ш': "Sh", 'ш': "sh",
    'Щ': "Shch", 'щ': "shch",
    'Ю': 'Iu', 'ю': "iu",
    'Я': 'Ia', 'я': "ia",
    'Зг': 'Zgh', 'зг': 'zgh',
    "\"": "", "`": "",
    "’": "", "'": "",
    "ь": "", "Ь": ""
}


const firstRule = {
    'Є': "Ye", 'є': "ye",
    'Ї': "Yi", 'ї': "yi",
    'Ю': "Y", 'ю': 'y',
    'Я': "Ya", 'я': 'ya',

}
function translit(text) {
    return text.split(" ").map((word) => {
        // перевірка на зг
        if (word.match('зг|Зг|ЗГ')) {
            word = word.replace('зг', 'zgh').replace('Зг', 'Zgh').replace('ЗГ', "ZGH")
        }
        // перевірка на наявність я ю є ї на початку слова
        if (["Я", "Ю", "Є", "Ї", 'я', 'ю', 'є', 'ї'].includes(word[0])) {
            let head = firstRule[(word[0])]
            let tail = word.slice(1).split('').map((char) => {
                if (Object.keys(rule).includes(char)) {
                    return rule[char]
                } else {
                    return char
                }
            }).join('')
            return head + tail
        } else {
            return word.split('').map(
                (char) => {
                    if (Object.keys(rule).includes(char)) {
                        return rule[char]
                    } else {
                        return char
                    }
                }
            ).join('')
        }
    }).join(" ")


}
function f1(text) {
    res = ''
    letters = Object.keys(rule)
    firstRuleLetters = Object.keys(firstRule)
    // заміняємо всі зг
    for (let i = 0; i < text.length; i++) {
        let char = text.charAt(i)
        // перевірка на наявність символа в правилах для перши літер я|ю|є|ї а також на те що це початок слова
        if (!letters.includes(text.charAt(i - 1)) && firstRuleLetters.includes(char)) {
            res = res.concat(firstRule[char])
            // перевірка на наявність символа в загальних правилах для літер
        } else if (letters.includes(char)) {
            if ((char == "з" || char == "З") && (text.charAt(i + 1) == 'г' ||text.charAt(i + 1) =='Г')){
                res = res.concat(rule[char]).concat('gh')
                i++
                continue
            }
            res = res.concat(rule[char])
            // інакше просто додаємо симол який знайшли
        } else {
            res = res.concat(char)
        }
    }
    return res

}

text = "Яблуко, їжак. Ялта, парус. Янукович, каюта, розв'`\"’язувати задачі з розгону тіла.!?*%;"
text='Поняття "інтелігенція", "інтелігентність", на відміну від так званих "вічних" понять, з\'явилися в нашій мові порівняно недавно, в 60-х роках XIX століття. Інтелігентами називали людей, що були зайняті розумовою працею, на відміну від тих, хто був зайнятий працею фізичною. Спершу вважали: інтелігентна людина — це та, яка здобула гарну освіту, багато читає, знає іноземні мови. Але можна все це мати і бути неінтелігентним, а можна мати те, що називається природженою, внутрішньою інтелігентністю. І не основне при цьому — диплом про вищу освіту. Ця якість — інтелігентність — наявністю диплома не визначається.\n' +
    '\n' +
    'Першим твором в українській літературі, головними персонажами якого стали українські інтелігенти, був роман І. С. Нечуя-Левицького "Хмари". Він став несподіванкою для багатьох, бо панувала думка, що українська література є виключно селянською і в українського народу нікого, крім селян, немає. І. С. Нечуй-Левйцький змалював два покоління інтелігенції. Старше, яке представляє Дашкович, спершу студент, а потім професор Київського університету. Він палко бажає служити народові України — занедбаному, пригніченому, "безщасному". У зрілому віці Дашкович стає пасивним, не принісши користі своєму народові. Його талант марно загинув, "згинув надаремно для України і народу". Хмари над рідною землею хоче розвіяти представник другого покоління української інтелігенції — Павло Радюк. Вік діяльніший за Дашковича — поширює твори Тараса Шевченка, пропагує історію України. І. С. Нечуй-Левицький підводив читачів до висновку: кожне нове, наступне покоління інтелігентів повинно дбати про добробут народу, підносити ідею національної гідності, відстоювати незалежність Вітчизни.\n' +
    '\n' +
    'Справжня інтелігентність була властива кращим українським письменникам, яких називали "совістю і сумлінням нації". Серед них — О. П. Довженко. У повісті "Зачарована Десна" він писав про свого батька, неграмотного, забитого вічними нестатками селянина, з глибокою шанобою схиляючись перед його внутрішньою інтелігентністю.\n' +
    '\n' +
    'То ж будемо пам\'ятати, що справжня інтелігентність — це, насамперед, внутрішня культура, доброта, чуйність, здатність до співпереживання.'

t1=[]
t2=[]

for (e=0;e<5000;e++){
    start = new Date().getTime();
    (async () => await f1(text))()
    end = new Date().getTime();
    t1.push(end - start)

}

// console.log(translit(text))
for (e=0;e<5000;e++) {
    start = new Date().getTime();
    (async () => await translit(text))()
    end = new Date().getTime();
    t2.push(end - start)
}
console.log(t1.reduce((partial_sum, a) => partial_sum + a, 0) / t1.length )
console.log(t2.reduce((partial_sum, a) => partial_sum + a, 0) / t2.length )